// Задача 19
// Напишите программу, которая принимает на вход пятизначное число
// и проверяет, является ли оно палиндромом.

// Console.Write("Введите ваше число: ");
// int checkPalindrom = Convert.ToInt32(Console.ReadLine());

// bool ItsPolindrome(int arg){
//     if (arg / 10000 == arg % 10 && (arg / 1000) % 10 == (arg % 100) / 10)
//     return true;
//     else return false;
// }

// Console.Write(ItsPolindrome(checkPalindrom));
